## Plan Result (Managed_Identity)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 0 to change, 4 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.acme-vault-access
* Delete
  * azurerm_role_assignment.acme-vault-access[&#34;e1f40a06-0c5e-4c63-a804-163b8911cc87&#34;]
  * azurerm_role_assignment.acme-vault-access[&#34;ff47ab8f-e4d9-48f2-ad31-af5933824849&#34;]
* Replace
  * azurerm_role_assignment.acme-vault-reader
  * azurerm_user_assigned_identity.wi-admin-mi




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.acme-vault-access will be created
  + resource "azurerm_role_assignment" "acme-vault-access" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ff47ab8f-e4d9-48f2-ad31-af5933824849"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappssbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.acme-vault-access["e1f40a06-0c5e-4c63-a804-163b8911cc87"] will be destroyed
  # (because resource does not use for_each)
  - resource "azurerm_role_assignment" "acme-vault-access" {
      - id                   = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappssbox/providers/Microsoft.Authorization/roleAssignments/c39bb4f9-bb99-36a0-1a54-18007731fd0f" -> null
      - name                 = "c39bb4f9-bb99-36a0-1a54-18007731fd0f" -> null
      - principal_id         = "e1f40a06-0c5e-4c63-a804-163b8911cc87" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> null
      - role_definition_name = "Key Vault Secrets User" -> null
      - scope                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappssbox" -> null
    }

  # azurerm_role_assignment.acme-vault-access["ff47ab8f-e4d9-48f2-ad31-af5933824849"] will be destroyed
  # (because resource does not use for_each)
  - resource "azurerm_role_assignment" "acme-vault-access" {
      - id                   = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappssbox/providers/Microsoft.Authorization/roleAssignments/25eb0754-c49a-300b-8a42-252d96d1b197" -> null
      - name                 = "25eb0754-c49a-300b-8a42-252d96d1b197" -> null
      - principal_id         = "ff47ab8f-e4d9-48f2-ad31-af5933824849" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> null
      - role_definition_name = "Key Vault Secrets User" -> null
      - scope                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappssbox" -> null
    }

  # azurerm_role_assignment.acme-vault-reader must be replaced
-/+ resource "azurerm_role_assignment" "acme-vault-reader" {
      ~ id                               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappssbox/providers/Microsoft.Authorization/roleAssignments/737779f2-053b-d4e0-78bc-ba54c50ad96a" -> (known after apply)
      ~ name                             = "737779f2-053b-d4e0-78bc-ba54c50ad96a" -> (known after apply)
      ~ principal_id                     = "e1f40a06-0c5e-4c63-a804-163b8911cc87" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/providers/Microsoft.Authorization/roleDefinitions/21090545-7ca7-4776-b22c-e363652d74d2" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_user_assigned_identity.wi-admin-mi must be replaced
-/+ resource "azurerm_user_assigned_identity" "wi-admin-mi" {
      ~ client_id           = "8ff5473c-4779-4831-be9b-07ded6a33ee9" -> (known after apply)
      ~ id                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/managed-identities-sbox-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/admin-sandbox-mi" -> (known after apply)
      ~ name                = "admin-sandbox-mi" -> "admin-sbox-mi" # forces replacement
      ~ principal_id        = "e1f40a06-0c5e-4c63-a804-163b8911cc87" -> (known after apply)
      ~ resource_group_name = "managed-identities-sbox-rg" -> "managed-identities-sandbox-rg" # forces replacement
        tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
      ~ tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 0 to change, 4 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":543,"Program":"tfcmt","SHA1":"","Target":"Managed_Identity","Vars":{}} -->